benchmark-results/round-3-intel/dragonfly - 6 noaffinity.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      2037882.45          ---          ---         0.75367         0.75900         0.87900         0.95100         1.15900         1.31900         1.69500         1.79900         2.14300        20.47900    135107.25 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    2037882.45         0.00         0.00         0.75367         0.75900         0.87900         0.95100         1.15900         1.31900         1.69500         1.79900         2.14300        20.47900    135107.25 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       206263.06          ---          ---         0.68115         0.68700         0.79100         0.87100         1.07100         1.20700         1.45500         1.53500         1.70300         2.41500     13695.90 
Gets      2062607.94     12020.48   2050587.46         0.68092         0.68700         0.79100         0.87100         1.07100         1.20700         1.45500         1.53500         1.70300         2.41500     82828.44 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    2268871.00     12020.48   2050587.46         0.68094         0.68700         0.79100         0.87100         1.07100         1.20700         1.45500         1.53500         1.70300         2.41500     96524.34 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        72122.45          ---          ---         0.24904         0.23900         0.29500         0.37500         0.52700         0.63100         0.71900         0.75100         0.95100         1.93500      4788.86 
Gets       721129.27      4251.83    716877.44         0.24845         0.23900         0.29500         0.37500         0.52700         0.63100         0.71100         0.73500         0.81500         1.19100     28959.34 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     793251.72      4251.83    716877.44         0.24851         0.23900         0.29500         0.37500         0.52700         0.63100         0.71100         0.73500         0.82300         1.93500     33748.20 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       185315.63          ---          ---         0.75015         0.75100         0.87100         0.94300         1.15100         1.28700         1.52700         1.63900         1.84700         3.19900     12286.06 
Gets      1853135.90   1853135.90         0.00         0.75000         0.75100         0.87100         0.94300         1.14300         1.28700         1.52700         1.63100         1.83900         3.19900    113810.40 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    2038451.52   1853135.90         0.00         0.75001         0.75100         0.87100         0.94300         1.14300         1.28700         1.52700         1.63100         1.84700         3.19900    126096.46 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        69187.32          ---          ---         0.26100         0.24700         0.31900         0.39100         0.55100         0.65500         0.75100         0.80700         1.04700         1.31100      4586.78 
Gets       691781.86    691781.86         0.00         0.26060         0.24700         0.31900         0.39100         0.55100         0.65500         0.74300         0.78300         0.97500         1.21500     42485.50 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     760969.17    691781.86         0.00         0.26063         0.24700         0.31900         0.39100         0.55100         0.65500         0.74300         0.78300         0.98300         1.31100     47072.28